[
  {
    "link": "https://github.com/natty-light/QS2",
    "text": "An expanded-on implementation of my QuonkScript programming language in Go, following along to the books \"Writing an Interpreter in Go\" and \"Writing a Compiler in Go\", by Thorsten Ball",
    "title": "QS2",
    "buttonText": "repo",
    "buttonIcon": "mdi:github"
  },
  {
    "link": "https://github.com/natty-light/batch",
    "text": "a simple package for processing network requests in batches, written in TypeScript. this project came about because at work, I was running into the same problem over and over, where I needed to make batched requests to an API to both read and write data. while this code isn't the route I ended up going, I wanted to implement something simple and barebones that could handle the job. this was also the first foray into publishing an NPM package for me, so a learning opportunity there as well",
    "title": "batch",
    "buttonText": "repo",
    "buttonIcon": "mdi:github"
  },
  {
    "link": "https://github.com/natty-light/natty-light.github.io",
    "text": "My personal website (this site!) built using React and NextJS, and hosted on GH Pages. the tech stack used here was picked because that's what I use at work, and I figured I could use what I have learned starting off my career as a developer to build something better than what I had. it's still a work in progress and probably will be for some time, but I intend to keep iterating on it and learning more about building websites as I go",
    "buttonIcon": "mdi:github",
    "buttonText": "repo",
    "title": "ngallant.dev"
  },
  {
    "link": "https://github.com/natty-light/life",
    "text": "Conway's Game of Life implemented in Go using OpenGL. this was one of my first projects using OpenGL. I had written a pong clone in C++ years before, and wanted to revist it. I have always found the rendering pipeline very interesting, but never understood how it works. this project builds a simple rendering engine for the game from scratch using Go's OpenGL bindings, and was a great learning experience for me",
    "title": "Life",
    "buttonText": "repo",
    "buttonIcon": "mdi:github"
  }
]